import { Button } from "@mui/material";
import { Link, useSearchParams } from "@remix-run/react";
import { useEffect } from "react";

const InfoRoute = () => {
  const [searchParams, setSearchParams] = useSearchParams();

  useEffect(() => {
    if (!searchParams.get("q")) setSearchParams("?q=contact");
  }, [searchParams]);

  return (
    <div className="mt-5 w-full lg:w-2/3 2xl:w-1/2 m-auto">
      <div className="flex justify-center">
        <div className="sticky top-[74px]">
          <div className="top-[74px] sticky flex flex-col gap-y-1">
            <Button
              onClick={() => setSearchParams(`?q=contact`)}
              className={`${
                searchParams.get("q") === "contact" ? "" : "text-black"
              } `}
            >
              Зв'язатися з нами
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=about`)}
              className={`${
                searchParams.get("q") === "about" ? "" : "text-black"
              }`}
            >
              Про нас
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=safe`)}
              className={`${
                searchParams.get("q") === "safe" ? "" : "text-black"
              }`}
            >
              Безпечне замовлення
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=payment`)}
              className={`${
                searchParams.get("q") === "payment" ? "" : "text-black"
              } `}
            >
              Оплата та доставка
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=privacy`)}
              className={`${
                searchParams.get("q") === "privacy" ? "" : "text-black"
              } `}
            >
              Політика конфіденційності
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=terms`)}
              className={`${
                searchParams.get("q") === "terms" ? "" : "text-black"
              } `}
            >
              Офферта
            </Button>
          </div>
        </div>
        <div className="w-2/3 ml-8 mb-24 mt-[2px]">
          {searchParams.get("q") === "contact" && (
            <div className="whitespace-pre-wrap">
              <h1 className="font-semibold text-xl">Зв'язатися з нами</h1>
              <div className="mt-3">
                Ви можете зв'язатися з нами якщо у вас є будь які проблеми,
                питання чи пропозиції.
                <p className="mt-3">
                  email: hello.different.marketplace@gmail.com
                </p>
                <p>
                  telegram:{" "}
                  <a
                    className="text-blue-500 underline underline-offset-[5px]"
                    href="https://t.me/DifferentMarketplace"
                  >
                    @DifferentMarketplace
                  </a>
                </p>
              </div>
            </div>
          )}
          {searchParams.get("q") === "about" && (
            <div>
              <h1 className="font-semibold text-xl">Про нас</h1>
              <div className="mt-2">
                Different - це маркетплейс, що не має обмежень та упереджень.
                Наш орієнтир - секонд-хенд одяг та аксессуари. Ми прагнемо
                задовільнити бажання кожного, хто хоче стильно одягатись, та
                дати можливість зручно, швидко та безпечно продавати речі.
                <p className="mt-2 font-medium text-lg">Особливості</p>
                <p className="mt-2">
                  Different - безкоштовна платформа. Вам не потрібно платити за
                  розміщення оголошень. Єдиною платною функцією є{" "}
                  <span>
                    <Link
                      className="underline  hover:text-blue-800"
                      to="/info?q=safe"
                    >
                      Безпечне замовлення
                    </Link>
                  </span>{" "}
                  (детальніше за посиланням). Якщо Ви не хочете витрачати кошти
                  на вашу безпеку, Ви можете домовитись особисто з продавцем. Ми
                  цінуємо свободу наших користувачів, тому завжди даємо
                  безкоштовну альтернативу.
                </p>
                <p className="mt-2 font-medium text-lg">Що ми пропонуємо?</p>
                <p className="mt-2">
                  Зрозумілій інтерфейс для продавців і доступний пошук для
                  покупців. Можливість вільно продавати необмежену кількість
                  товарів і купувати речі через захищену систему. Здатність
                  аналізувати ринкову економіку за допомогою функції "Продані".
                  Зручний чат для зв'язку між продавцем та покупцем. Усе це, та
                  ще більше іншого Ви можете знайти на нашому сайті.
                </p>
              </div>
            </div>
          )}
          {searchParams.get("q") === "safe" && (
            <div>
              <h1 className="font-semibold text-xl">Безпечне замовлення</h1>
              <p>
                <br />
              </p>
              <p>
                Купуючи товар через Different, ви автоматично використовуєте
                функцію Безпечне замовлення. <strong>Комісія - 5%.</strong>
                <br /> Механізм Безпечного замовлення:
                <br />- Покупець сплачує кошти за товар на сайті, після цього
                вони надходять на рахунок Different.
                <br />- Продавець відправляє товар та вказує трек номер посилки
                Нова Пошта.
                <br />- Покупець отримує товар, кошти з нашого рахунку надходять
                продавцю.
                <br />- Якщо покупець відмовився від товару, або не прийшов до
                відділення Нової Пошти, кошти повертаються на рахунок покупця.
                <br />- Якщо продавець не надіслав трек номер протягом 15 днів,
                у покупця є можливість повернути кошти.
              </p>
            </div>
          )}
          {searchParams.get("q") === "payment" && (
            <div>
              <h1 className="font-semibold text-xl">Оплата та доставка</h1>
              <p>
                <br />
              </p>
              <p>
                Different дає можливість Продавцю в рамках послуги Безпечне
                замовлення додавати Оголошення з опцією доставки, яка буде
                виконана Логістичним партнером, а Покупцеві придбати Позицію з
                Доставкою шляхом переказу коштів у національній валюті між
                поточними рахунками фізичних осіб з використанням електронних
                платіжних засобів &laquo;Переказ з картки на карту&raquo;.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  &nbsp;Доставка здійснюється Логістичним партнером
                </strong>
              </p>
              <p>
                <br />
              </p>
              <p>
                ТОВ &laquo;НОВА ПОШТА&raquo; (код ЄДРПОУ 31316718, 03026, Київ,
                Столичне шосе, 103, корпус 1, поверх 9).
              </p>
              <p>
                Послуги з інформаційного та технологічного обслуговування, які
                полягають у наданні можливості формувати в електронному вигляді
                запити на отримання послуги переказу коштів у національній
                валюті між поточними рахунками фізичних осіб з використанням
                електронних платіжних засобів &laquo;Переказ з картки на
                картку&raquo; надаються Платіжним партнером &ndash; LiqPay.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>Вимоги до оголошень</strong>
              </p>
              <p>
                <br />
              </p>
              <p>
                1) В оголошенні має бути зазначена актуальна ціна, оскільки при
                оформленні замовлення на карті Покупця утримується сума вартості
                Позиції. Якщо ви продаєте набір/комплект товарів, ціна повинна
                бути вказана за весь набір/комплект.
              </p>
              <p>
                2) З послугою Безпечне замовлення можна купувати та продавати
                товари об&apos;ємною вагою до 30 кг (при цьому найдовша сторона
                відправлення для ТОВ &laquo;НОВА ПОШТА&raquo; у поштовому
                відділенні не повинна бути більше 120 см.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  Оплата за послуги Логістичного та Платіжного партнера
                </strong>
              </p>
              <p>
                <br />
              </p>
              <p>
                1) Доставка в один бік оплачується Покупцем. Якщо Покупець не
                прийшов по товар у відділення Логістичного партнера, або
                відмовився від посилки, вона відправляється назад Продавцю, за
                доставку якої платить останній.
              </p>
              <p>
                2) Покупець оплачує комісію Платіжному партнеру за здійснення
                транзакції переказу коштів із картки на картку. Комісія
                встановлюється у розмірі 5%.
              </p>
              <p>
                3) Для карт, емітованих певними банками можуть встановлюватися
                додаткові комісії, а також, додаткові комісії можуть бути
                передбачені при використанні кредитних коштів. Остаточний розмір
                комісії обов&apos;язково відображається на сторінці оплати. Якщо
                угоду завершено не успішно, комісія платіжного партнера не
                повертається Покупцю.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  Використовуючи послугу Безпечне замовлення, Продавець та
                  Покупець погоджуються з:
                </strong>
              </p>
              <p>
                <br />
              </p>
              <p>
                - умовами надання сервісу переказів та погоджуються на обробку
                своїх персональних даних Платіжним партнером;
              </p>
              <p>- умовами прийому платежів;</p>
              <p>
                - залежно від обраного Логістичного партнера, з умовами надання
                послуг Логістичним партнером НОВА ПОШТА/ Публічним договором
                Логістичного партнера НОВА ПОШТА.
              </p>
              <p>
                Different не є стороною таких угод і не може втручатися у їх
                зміст чи виконання. Зокрема, у разі виникнення будь-яких проблем
                з Доставкою, Продавець або Покупець повинен зв&apos;язатися з
                Логістичним партнером та/або Платіжним партнером, щоб
                з&apos;ясувати проблему або подати скаргу.
              </p>
              <p>
                <br />
              </p>
            </div>
          )}
          {searchParams.get("q") === "privacy" && (
            <div>
              <h1 className="font-semibold text-xl">
                Політика конфіденційності
              </h1>
              <p>
                <br />
              </p>
              <p>
                Ознайомтеся, будь ласка, з Правилами збору, обробки та
                зберіганням персональних даних клієнтів (далі Правила). Правила
                встановлені сервісом колективних покупок DIFFERENT (
                <a href="http://different-marketplace.com">
                  http://different-marketplace.com
                </a>
                ) і визначають порядок обробки Different персональних даних
                користувачів, зареєстрованих на сайті{" "}
                <a href="http://different-marketplace.com">
                  http://different-marketplace.com
                </a>
                . Справжні правила є
                невід&apos;ємною&nbsp;частиною&nbsp;Публічної&nbsp;оферти
                (угоди) з користувачами&nbsp;Інтернет-сайту DIFFERENT.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>1.</strong> <strong>Основні</strong>{" "}
                <strong>положення</strong>.<br />
                <p>
                  <br />
                </p>
                Реєструючись на Інтернет-сайті{" "}
                <a href="http://different-marketplace.com">
                  http://different-marketplace.com
                </a>
                , Користувач тим самим погоджується з цими Правилами і надає
                дозвіл DIFFERENT на збір, зберігання, використання та
                розголошення своїх персональних даних відповідно до цих Правил,
                Законами України &laquo;Про захист персональних даних&raquo;,
                &laquo;Про захист прав споживачів &raquo;,&laquo; Про захист
                інформації в інформаційно-телекомунікаційних системах &raquo;.
                Правила дійсні на території України, з моменту реєстрації
                користувача на{" "}
                <a href="http://different-marketplace.com">
                  http://different-marketplace.com
                </a>
                &nbsp; &nbsp;&nbsp;
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  2. Збір та використання&nbsp;персональних&nbsp;даних про
                  клієнта.
                </strong>
                <br />
                <p>
                  <br />
                </p>
                DIFFERENT може збирати, зберігати і використовувати такі
                персональні дані:
                <br />- ім&apos;я (прізвище, ім&apos;я, по батькові);
                <br />- адреса електронної пошти (e-mail);
                <br />- номер мобільного телефону;
                <br />- дата народження;
                <br />- Місто;
                <br />- історія використання користувачем Інтернет-сайту
                DIFFERENT ;<br />- нік Користувача;
                <br />- пароль Користувача.
                <br />
                Користувач погоджується з тим, що DIFFERENT може використовувати
                персональні дані клієнта для:
                <br />- надання послуг і клієнтської підтримки на запит клієнта;
                <br />- поліпшення власних послуг, змісту сайту та реклами;
                <br />- повідомлення клієнта про послуги, новини і рекламних
                пропозиціях DIFFERENT і партнерів DIFFERENT за допомогою SMS,
                електронних повідомлень, пошти і т.д.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>3.</strong>{" "}
                <strong>Розголошення&nbsp;персональних&nbsp;даних</strong>
                <p>
                  <br />
                </p>
                DIFFERENT&nbsp;&nbsp;має право надавати&nbsp;третім особам
                персональні&nbsp;дані&nbsp;користувача в
                наступних&nbsp;обмежених&nbsp;випадках:
                <br />-
                DIFFERENT&nbsp;&nbsp;отримав&nbsp;додаткову&nbsp;згоду&nbsp;клієнта;
                <br />-
                DIFFERENT&nbsp;&nbsp;надає&nbsp;таку&nbsp;інформацію&nbsp;своїм
                партнерам, дочірнім&nbsp;компаніям, агентствам і субпідрядникам,
                іншим&nbsp;третім особам з метою, для
                якої&nbsp;ця&nbsp;інформація&nbsp;була&nbsp;зібрана. DIFFERENT
                зажадає&nbsp;від&nbsp;даних&nbsp;осіб&nbsp;згоди на
                використання&nbsp;інформації&nbsp;відповідно до інструкцій
                DIFFERENT і цими Правилами, а так само
                іншими&nbsp;належними&nbsp;засобами&nbsp;збереження&nbsp;конфіденційності
                та безпеки.
                <br />-
                DIFFERENT&nbsp;&nbsp;надає&nbsp;таку&nbsp;інформацію&nbsp;правоохоронним
                та іншим&nbsp;державним органам у відповідь на їх&nbsp;офіційний
                запит,
                що&nbsp;стосується&nbsp;кримінального&nbsp;розслідування&nbsp;або&nbsp;передбачуваної&nbsp;протиправної&nbsp;діяльності.
                В такому випадку, DIFFERENT розголосить&nbsp;інформацію,
                що&nbsp;має&nbsp;значення для розслідування, а саме: ім&apos;я,
                адреса доставки, поштовий&nbsp;індекс, номер мобільного
                телефону, електронна адреса, дату народження, дані про покупки.
                <br />- DIFFERENT може надавати третім особам загальну
                інформацію (статистичні дані, узагальнену інформацію), яка не
                містить персональну інформацію і яка не ідентифікує клієнта
                індивідуально.
                <br />
                Персональні дані користувача зберігаються на сервері
                DIFFERENT&nbsp;&nbsp;який&nbsp;може&nbsp;фізично&nbsp;знаходиться
                як в Україні так і за кордоном. Користувач&nbsp;підтверджує і
                надає DIFFERENT право переміщувати&nbsp;персональні&nbsp;дані
                через кордон України з метою, для
                якої&nbsp;ця&nbsp;інформація&nbsp;була&nbsp;зібрана. DIFFERENT
                зобов&apos;язується&nbsp;вживати&nbsp;належних&nbsp;заходів&nbsp;безпеки
                для захисту&nbsp;від незаконного
                втручання&nbsp;або&nbsp;неправомірного&nbsp;зміни,
                розголошення&nbsp;або&nbsp;знищення&nbsp;персональних&nbsp;даних&nbsp;користувача.
                <br />
                База персональних даних обробляється DIFFERENT за адресою:&nbsp;
                Франкфурт, Німеччина.
                <br />
                DIFFERENT несе одноосібну і повну юридичну відповідальність за
                захист персональних даних клієнта і за збір, зберігання, і
                використання персональних даних клієнта.
              </p>
              <p>
                <br />
              </p>
              <p>
                4.{" "}
                <strong>
                  Права користувачів як
                  суб&apos;єктів&nbsp;персональних&nbsp;даних:
                </strong>
                <p>
                  <br />
                </p>
                4.1. знати про джерела збору, місцезнаходження своїх
                персональних даних, мету їх обробки, місце знаходження або
                проживання (перебування) власника або розпорядника персональних
                даних, або дати відповідне доручення щодо отримання такої
                інформації уповноваженими ними особами, крім випадків
                встановлених законом.
                <br />
                4.2. отримувати інформацію про умови надання доступу до
                персональних даних, зокрема про третіх осіб, яким передаються їх
                персональні дані.
                <br />
                4.3. на доступ до своїх персональних даних.
                <br />
                4.4. отримувати не пізніше ніж за тридцять календарних днів з
                дня подання запиту, крім випадків передбачених законом,
                відповідь про те, обробляються чи їх персональні дані, а також
                отримувати зміст таких персональних даних.
                <br />
                4.5.пред&apos;являти вмотивовану вимогу власнику персональних
                даних із запереченням проти обробки своїх персональних даних.
                <br />
                4.6.пред&apos;являти вмотивовану вимогу щодо зміни або видалення
                своїх персональних даних будь-яким власником і розпорядником
                персональних даних, якщо ці дані обробляються незаконно чи є
                недостовірними.
                <br />
                4.7. на захист своїх персональних даних від незаконної обробки
                та випадкової втрати, знищення, пошкодження у зв&apos;язку з
                умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а
                також на захист від надання відомостей, що є недостовірними чи
                ганьблять честь, гордість і ділову репутацію фізичної особи.
                <br />
                4.8. звертатися зі скаргами на обробку своїх персональних даних
                до Уповноваженого, або до суду.
                <br />
                4.9. Застосовувати засоби правового захисту в разі порушення
                законодавства про захист персональних даних.
                <br />
                4.10. Вносити застереження щодо обмеження права на обробку своїх
                персональних даних під час надання згоди.
                <br />
                4.11. відкликати згоду на обробку персональних даних.
                <br />
                4.12. знати механізм автоматичної обробки персональних даних.
                <br />
                4.13. на захист від автоматизованого рішення, яке має для нього
                праві наслідки.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  5. Видалення&nbsp;персональних&nbsp;даних та
                  відмова&nbsp;від&nbsp;розсилки
                </strong>
                <p>
                  <br />
                </p>
                При зміні персональних даних користувача, згаданих в пункті 2
                (наприклад, мобільний телефон, електронну адресу), а також, якщо
                Користувач не хоче більше користуватися послугами сервісу
                колективних покупок DIFFERENT, ми надаємо можливість зміни або
                видалення / деактивації даних.
                <br />
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  6. Власником бази даних користувачів Інтернет-сайту&nbsp;
                </strong>
                <a href="http://different-marketplace.com">
                  <strong>http://different-marketplace.com</strong>
                </a>
                <strong>&nbsp;є DIFFERENT:</strong>
              </p>
              <p>
                <br />
              </p>

              <p>ФОП Ліштван Сергій Олександрович, код едрпоу 3719907573</p>
            </div>
          )}
          {searchParams.get("q") === "terms" && (
            <div>
              <h1 className="font-semibold text-xl">Офферта</h1>
              <p>
                <br />
              </p>
              <p>
                ФОП Ліштван Сергій Олександрович (код ЄДРПОУ 3719907573), (далі
                &mdash; Виконавець),&nbsp;який діє на підставі свідоцтва про
                реєстрацію у відповідності до&nbsp;ст.641 Цивільного Кодексу
                України&nbsp;є офіційною пропозицією (публічною офертою)
                адміністратора сайту DIFFERENT-MARKETPLACE.COM, що є фізичною
                особою, надалі за текстом &ndash;&nbsp;&bdquo;
                <strong>Виконавець</strong>&rdquo;, укласти Договір з фізичною
                особою про надання рекламно-інформаційних послуг, надалі за
                текстом &ndash;&nbsp;&bdquo;<strong>Оферта</strong>&rdquo;, і
                містить істотні умови, необхідні для надання
                рекламно-інформаційних послуг, надалі за текстом
                &ndash;&nbsp;&bdquo;<strong>Послуги</strong>&rdquo;.
              </p>
              <p>
                1.2. Згідно з&nbsp;ч.2 ст.642 Цивільного Кодексу України&nbsp;у
                випадку прийняття нижче вказаних умов і сплати коштів за
                майбутні Послуги, фізичні особи цим самим засвідчують своє
                бажання укласти Оферту, ця дія і є прийняттям пропозиції
                (аксепт), і з цього моменту вони визначаються
                як&nbsp;&bdquo;Користувачі&rdquo;.
              </p>
              <p>
                1.3. У звязку з вищевикладеним, уважно прочитайте текст цієї
                Оферти і якщо Ви не згодні з яким-небудь пунктом оферти,
                Виконавець пропонує Вам відмовитися від використання Послуг.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>1. Визначення понять</strong>
                <br />
                1.1. Сайт &mdash; інтернет-сайт DIFFERENT-MARKETPLACE.COM який
                представляє собою комунікаційну платформу для розміщення
                тимчасових оголошень.
              </p>
              <p>
                1.2. Користувач &mdash; будь-яка фізична, юридична особа та
                фізична особа-підприємець, яка акцептувала цю публічну оферту.
              </p>
              <p>
                <strong>2. Предмет договору</strong>
              </p>
              <p>
                2.1. Користувач отримує право розміщувати оголошення на Сайті
                після заповнення спеціальної форми із зазначенням параметрів
                запропонованих товарів або послуг.
              </p>
              <p>
                2.2 Використання можливостей і сервісів Сайта Користувачами
                означає прийняття зобов&apos;язань дотримуватися правил та
                інструкцій щодо користування послугами Виконавця, в тому числі
                цієї Угоди.
              </p>
              <p>
                2.3 З інформацією про вартість послуг, рекламні позиції, які на
                виконання цієї Оферти надає Виконавець, умови використання
                сайту, а також технічні вимоги, які ставляться до розміщення
                відповідних рекламно-інформаційних матеріалів, Замовник може
                ознайомитись на сайті DIFFERENT-MARKETPLACE.COM При укладенні
                Оферти Сторони керуються цією інформацією, яка являється
                невід&lsquo;ємною частиною, доповнюючи собою істотні умови
                Оферти і безпосередньо відноситься до цієї Оферти.
              </p>
              <p>
                2.4. Оферта, Прейскурант цін (вартість послуг) та Умови
                використання сайту є офіційними документами і публікуються на
                сайті DIFFERENT-MARKETPLACE.COM
              </p>
              <p>
                <strong>3. Приймання-передача наданих послуг</strong>
                <br />
                3.1. У разі наявності зауважень по наданих послуг, Користувач
                надсилає зауваження на адресу електронної пошти
                help@DIFFERENT-MARKETPLACE.COM??????????? протягом одного місяця
                з моменту виявлення надання послуг неналежної якості. У разі
                відсутності зауважень, послуги вважаються прийнятими Клієнтом
                належним чином.
              </p>
              <p>
                3.2. На запит Користувача, Сайт формує та надсилає на адресу
                електронної пошти Користувача Акт приймання-передачі наданих
                послуг, скріплений електронним цифровим підписом.
              </p>
              <p>
                <strong>4. Відповідальність сторін</strong>
                <br />
                4.1 Скориставшись сервісами Сайтів, Користувач підтверджує свою
                згоду з тим, що він використовує Сайти і його сервіси на свій
                страх і ризик &laquo;як є&raquo;, оцінює і несе всі ризики,
                пов&apos;язані з використанням розміщених на Сайтах оголошень, а
                Виконавець, в тому числі її керівництво , співробітники і
                агенти, не несуть ніякої відповідальності за зміст розміщених на
                Сайті оголошень, за будь-які збитки і втрати, які стали
                результатом використання розміщених на Сайтах оголошень
              </p>
              <p>
                4.2. Сторони звільняються від відповідальності за порушення
                зобов&rsquo;язань за Договором, якщо таке порушення є наслідком
                дії обставин непереборної сили і якщо Сторона доведе існування
                таких обставин.
              </p>
              <p>
                4.3. Під непереборною силою у Договорі розуміються будь-які
                надзвичайні події, які виникають без вини Сторін, поза їх волею
                або всупереч волі чи бажанню Сторін і які не можна за умови
                вжиття звичайних для цього заходів передбачити та не можна при
                всій обачності відвернути (уникнути), включаючи (але не
                обмежуючись) стихійні явища природного характеру (землетруси,
                пожежі, бурі, нагромадження снігу або ожеледь, повені, урагани,
                руйнування в результаті блискавки тощо), лиха біологічного,
                техногенного та антропогенного походження (вибухи, пожежі, вихід
                з ладу машин й обладнання, масові епідемії, епізоотії,
                епіфітотії тощо), обставини суспільного життя (війна, загроза
                війни, революції, заколоти, повстання, воєнні дії, блокади,
                громадські хвилювання, прояви тероризму, вибухи, масові страйки
                та локаути, бойкоти тощо), а також видання заборонних або
                обмежуючих актів органів державної влади чи місцевого
                самоврядування, інші законні або незаконні заборонні чи
                обмежуючі заходи названих органів, які унеможливлюють виконання
                Сторонами Договору або тимчасово перешкоджають такому виконанню.
              </p>
              <p>
                4.4. Сторона, для якої є неможливим виконання зобов&rsquo;язань
                за цим Договором внаслідок дії непереборної сили, повинна при
                першій можливості повідомити іншу Сторону про настання, ймовірну
                тривалість та закінчення строку таких дій.
              </p>
              <p>
                4.5. Доказом існування обставин непереборної сили та строку їх
                дії є належним чином оформлені довідки відповідних державних
                органів та/або Торговельної промислової палати за місцем
                виникнення такої події. Підтвердженням обставин непереборної
                сили, що відбулись у хостинг-провайдера Сайта (пожежа, повінь
                тощо) є повідомлення хостинг-провайдера.
              </p>
              <p>
                <strong>5.&nbsp;Порядок розрахунків</strong>
              </p>
              <p>
                5.1. Кошти за послуги знiмаються автоматично після отримання
                Користувачем замовлення, згідно діючого прейскуранта цін.
                Переглянути це можна в Особистому акаунтi.
              </p>
              <p>
                <strong>6. Строк дії договору</strong>
                <br />
                6.1. Цей Договор набуває чинності з моменту початку використання
                Користувачем будь-якого сервісу Сайту, або з моменту реєстрації
                Користувача на Сайті, і діє безстроково.
              </p>
              <p>
                <strong>7. Вирішення спорів</strong>
              </p>
              <p>
                7.1 Спори, що виникають між Сторонами вирішуються шляхом
                переговорів.
              </p>
              <p>
                7.2 Неврегульовані шляхом переговорів спори вирішуються шляхом
                передачі відповідного спору на розгляд до господарського суду
                згідно з встановленою підвідомчістю господарських справ
                відповідно до чинного законодавства України.
              </p>
              <p>
                <br />
              </p>
            </div>
          )}
        </div>
      </div>
    </div>
  );
};

export default InfoRoute;
