import { Button } from "@mui/material";
import { useSearchParams } from "@remix-run/react";
import { useEffect } from "react";
import monopay from "../assets/monopay.png";
import mastercard from "../assets/mastercard.png";
import visa from "../assets/visa.png";
import applepay from "../assets/applepay.png";
import googlepay from "../assets/googlepay.png";

const InfoRoute = () => {
  const [searchParams, setSearchParams] = useSearchParams();

  useEffect(() => {
    if (!searchParams.get("q")) setSearchParams("?q=contact");
  }, [searchParams]);

  return (
    <div className="m-auto mt-5 w-full lg:w-2/3 2xl:w-1/2">
      <div className="flex justify-center">
        <div className="sticky top-[74px]">
          <div className="sticky top-[74px] flex flex-col gap-y-1">
            <Button
              onClick={() => setSearchParams(`?q=contact`)}
              className={`${
                searchParams.get("q") === "contact" ? "" : "text-black"
              } `}
            >
              Зв'язатися з нами
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=about`)}
              className={`${
                searchParams.get("q") === "about" ? "" : "text-black"
              }`}
            >
              Про нас
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=guides`)}
              className={`${
                searchParams.get("q") === "guides" ? "" : "text-black"
              } `}
            >
              Поради та інструкції
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=privacy`)}
              className={`${
                searchParams.get("q") === "privacy" ? "" : "text-black"
              } `}
            >
              Політика конфіденційності
            </Button>
            <Button
              onClick={() => setSearchParams(`?q=terms`)}
              className={`${
                searchParams.get("q") === "terms" ? "" : "text-black"
              } `}
            >
              Умови використання
            </Button>
          </div>
        </div>
        <div className="mb-24 ml-8 mt-[2px] w-2/3">
          {searchParams.get("q") === "contact" && (
            <div className="whitespace-pre-wrap">
              <h1 className="text-xl font-semibold">Зв'язатися з нами</h1>
              <div className="mt-3">
                Ви можете зв'язатися з нами якщо у вас є будь які проблеми,
                питання чи пропозиції.
                <p className="mt-3">
                  email: hello.different.marketplace@gmail.com
                </p>
                <p>
                  telegram:{" "}
                  <a
                    className="text-blue-500 underline underline-offset-[5px]"
                    href="https://t.me/DifferentMarketplace"
                  >
                    @DifferentMarketplace
                  </a>
                </p>
              </div>
            </div>
          )}
          {searchParams.get("q") === "about" && (
            <div>
              <h1 className="text-xl font-semibold">Про нас</h1>
              <div className="mt-2">
                Different - це маркетплейс, що не має обмежень та упереджень.
                Наш орієнтир - секонд-хенд одяг та аксессуари. Ми прагнемо
                задовільнити бажання кожного, хто хоче стильно одягатись, та
                дати можливість зручно, швидко та безпечно продавати речі.
                <p className="mt-2 text-lg font-medium">Особливості</p>
                <p className="mt-2">
                  Different - повністю безкоштовна платформа для покупців та
                  частково для продавців. Продавцям не потрібно платити за
                  розміщення оголошень. Продавець сплачує комісію 5% після
                  завершення продажі якщо замовлення було оформлено через
                  Сейф-сервіс.
                </p>
                <p className="mt-2 text-lg font-medium">Що ми пропонуємо?</p>
                <p className="mt-2">
                  Зрозумілий інтерфейс для продавців і доступний пошук для
                  покупців. Можливість вільно продавати необмежену кількість
                  товарів і купувати речі через захищену систему. Здатність
                  аналізувати ринкову економіку за допомогою функції "Продані".
                  Зручний чат для зв'язку між продавцем та покупцем. Усе це, та
                  ще більше іншого Ви можете знайти на нашому сайті.
                </p>
              </div>
            </div>
          )}
          {searchParams.get("q") === "privacy" && (
            <div>
              <h1 className="text-xl font-semibold">
                Політика конфіденційності
              </h1>
              <p>
                <br />
              </p>
              <p>
                Ознайомтеся, будь ласка, з Правилами збору, обробки та
                зберіганням персональних даних клієнтів (далі Правила). Правила
                встановлені сервісом колективних покупок DIFFERENT (
                <a href="https://different-marketplace.com">
                  https://different-marketplace.com
                </a>
                ) і визначають порядок обробки Different персональних даних
                користувачів, зареєстрованих на сайті{" "}
                <a href="https://different-marketplace.com">
                  https://different-marketplace.com
                </a>
                . Справжні правила є
                невід&apos;ємною&nbsp;частиною&nbsp;Публічної&nbsp;оферти
                (угоди) з користувачами&nbsp;Інтернет-сайту DIFFERENT.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>1.</strong> <strong>Основні</strong>{" "}
                <strong>положення</strong>.<br />
                <p>
                  <br />
                </p>
                Реєструючись на Інтернет-сайті{" "}
                <a href="https://different-marketplace.com">
                  https://different-marketplace.com
                </a>
                , Користувач тим самим погоджується з цими Правилами і надає
                дозвіл DIFFERENT на збір, зберігання, використання та
                розголошення своїх персональних даних відповідно до цих Правил,
                Законами України &laquo;Про захист персональних даних&raquo;,
                &laquo;Про захист прав споживачів &raquo;,&laquo; Про захист
                інформації в інформаційно-телекомунікаційних системах &raquo;.
                Правила дійсні на території України, з моменту реєстрації
                користувача на{" "}
                <a href="https://different-marketplace.com">
                  https://different-marketplace.com
                </a>
                &nbsp; &nbsp;&nbsp;
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  2. Збір та використання&nbsp;персональних&nbsp;даних про
                  клієнта.
                </strong>
                <br />
                <p>
                  <br />
                </p>
                DIFFERENT може збирати, зберігати і використовувати такі
                персональні дані:
                <br />- ім&apos;я (прізвище, ім&apos;я, по батькові);
                <br />- адреса електронної пошти (e-mail);
                <br />- номер мобільного телефону;
                <br />- дата народження;
                <br />- Місто;
                <br />- історія використання користувачем Інтернет-сайту
                DIFFERENT ;<br />- нік Користувача;
                <br />- пароль Користувача.
                <br />
                Користувач погоджується з тим, що DIFFERENT може використовувати
                персональні дані клієнта для:
                <br />- надання послуг і клієнтської підтримки на запит клієнта;
                <br />- поліпшення власних послуг, змісту сайту та реклами;
                <br />- повідомлення клієнта про послуги, новини і рекламних
                пропозиціях DIFFERENT і партнерів DIFFERENT за допомогою SMS,
                електронних повідомлень, пошти і т.д.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>3.</strong>{" "}
                <strong>Розголошення&nbsp;персональних&nbsp;даних</strong>
                <p>
                  <br />
                </p>
                DIFFERENT&nbsp;&nbsp;має право надавати&nbsp;третім особам
                персональні&nbsp;дані&nbsp;користувача в
                наступних&nbsp;обмежених&nbsp;випадках:
                <br />-
                DIFFERENT&nbsp;&nbsp;отримав&nbsp;додаткову&nbsp;згоду&nbsp;клієнта;
                <br />-
                DIFFERENT&nbsp;&nbsp;надає&nbsp;таку&nbsp;інформацію&nbsp;своїм
                партнерам, дочірнім&nbsp;компаніям, агентствам і субпідрядникам,
                іншим&nbsp;третім особам з метою, для
                якої&nbsp;ця&nbsp;інформація&nbsp;була&nbsp;зібрана. DIFFERENT
                зажадає&nbsp;від&nbsp;даних&nbsp;осіб&nbsp;згоди на
                використання&nbsp;інформації&nbsp;відповідно до інструкцій
                DIFFERENT і цими Правилами, а так само
                іншими&nbsp;належними&nbsp;засобами&nbsp;збереження&nbsp;конфіденційності
                та безпеки.
                <br />-
                DIFFERENT&nbsp;&nbsp;надає&nbsp;таку&nbsp;інформацію&nbsp;правоохоронним
                та іншим&nbsp;державним органам у відповідь на їх&nbsp;офіційний
                запит,
                що&nbsp;стосується&nbsp;кримінального&nbsp;розслідування&nbsp;або&nbsp;передбачуваної&nbsp;протиправної&nbsp;діяльності.
                В такому випадку, DIFFERENT розголосить&nbsp;інформацію,
                що&nbsp;має&nbsp;значення для розслідування, а саме: ім&apos;я,
                адреса доставки, поштовий&nbsp;індекс, номер мобільного
                телефону, електронна адреса, дату народження, дані про покупки.
                <br />- DIFFERENT може надавати третім особам загальну
                інформацію (статистичні дані, узагальнену інформацію), яка не
                містить персональну інформацію і яка не ідентифікує клієнта
                індивідуально.
                <br />
                Персональні дані користувача зберігаються на сервері
                DIFFERENT&nbsp;&nbsp;який&nbsp;може&nbsp;фізично&nbsp;знаходиться
                як в Україні так і за кордоном. Користувач&nbsp;підтверджує і
                надає DIFFERENT право переміщувати&nbsp;персональні&nbsp;дані
                через кордон України з метою, для
                якої&nbsp;ця&nbsp;інформація&nbsp;була&nbsp;зібрана. DIFFERENT
                зобов&apos;язується&nbsp;вживати&nbsp;належних&nbsp;заходів&nbsp;безпеки
                для захисту&nbsp;від незаконного
                втручання&nbsp;або&nbsp;неправомірного&nbsp;зміни,
                розголошення&nbsp;або&nbsp;знищення&nbsp;персональних&nbsp;даних&nbsp;користувача.
                <br />
                База персональних даних обробляється DIFFERENT за адресою:&nbsp;
                Франкфурт, Німеччина.
                <br />
                DIFFERENT несе одноосібну і повну юридичну відповідальність за
                захист персональних даних клієнта і за збір, зберігання, і
                використання персональних даних клієнта.
              </p>
              <p>
                <br />
              </p>
              <p>
                4.{" "}
                <strong>
                  Права користувачів як
                  суб&apos;єктів&nbsp;персональних&nbsp;даних:
                </strong>
                <p>
                  <br />
                </p>
                4.1. знати про джерела збору, місцезнаходження своїх
                персональних даних, мету їх обробки, місце знаходження або
                проживання (перебування) власника або розпорядника персональних
                даних, або дати відповідне доручення щодо отримання такої
                інформації уповноваженими ними особами, крім випадків
                встановлених законом.
                <br />
                4.2. отримувати інформацію про умови надання доступу до
                персональних даних, зокрема про третіх осіб, яким передаються їх
                персональні дані.
                <br />
                4.3. на доступ до своїх персональних даних.
                <br />
                4.4. отримувати не пізніше ніж за тридцять календарних днів з
                дня подання запиту, крім випадків передбачених законом,
                відповідь про те, обробляються чи їх персональні дані, а також
                отримувати зміст таких персональних даних.
                <br />
                4.5.пред&apos;являти вмотивовану вимогу власнику персональних
                даних із запереченням проти обробки своїх персональних даних.
                <br />
                4.6.пред&apos;являти вмотивовану вимогу щодо зміни або видалення
                своїх персональних даних будь-яким власником і розпорядником
                персональних даних, якщо ці дані обробляються незаконно чи є
                недостовірними.
                <br />
                4.7. на захист своїх персональних даних від незаконної обробки
                та випадкової втрати, знищення, пошкодження у зв&apos;язку з
                умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а
                також на захист від надання відомостей, що є недостовірними чи
                ганьблять честь, гордість і ділову репутацію фізичної особи.
                <br />
                4.8. звертатися зі скаргами на обробку своїх персональних даних
                до Уповноваженого, або до суду.
                <br />
                4.9. Застосовувати засоби правового захисту в разі порушення
                законодавства про захист персональних даних.
                <br />
                4.10. Вносити застереження щодо обмеження права на обробку своїх
                персональних даних під час надання згоди.
                <br />
                4.11. відкликати згоду на обробку персональних даних.
                <br />
                4.12. знати механізм автоматичної обробки персональних даних.
                <br />
                4.13. на захист від автоматизованого рішення, яке має для нього
                праві наслідки.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  5. Видалення&nbsp;персональних&nbsp;даних та
                  відмова&nbsp;від&nbsp;розсилки
                </strong>
                <p>
                  <br />
                </p>
                При зміні персональних даних користувача, згаданих в пункті 2
                (наприклад, мобільний телефон, електронну адресу), а також, якщо
                Користувач не хоче більше користуватися послугами сервісу
                колективних покупок DIFFERENT, ми надаємо можливість зміни або
                видалення / деактивації даних.
                <br />
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>
                  6. Власником бази даних користувачів Інтернет-сайту&nbsp;
                </strong>
                <a href="https://different-marketplace.com">
                  <strong>https://different-marketplace.com</strong>
                </a>
                <strong>&nbsp;є DIFFERENT:</strong>
              </p>
              <p>
                <br />
              </p>

              <p>ФОП Ліштван Сергій Олександрович, код едрпоу 3719907573</p>
            </div>
          )}
          {searchParams.get("q") === "guides" && (
            <div>
              <h1 className="text-xl font-semibold">Поради та інструкції</h1>
              <div className="mt-4">
                <a
                  href="https://different-marketplace.notion.site/a55a5e3a915e4617a209442bb7793477"
                  className="text-blue-500 underline underline-offset-[5px]"
                  target="_blank"
                  rel="noreferrer"
                >
                  Інструкція для продавців
                </a>
              </div>
            </div>
          )}
          {searchParams.get("q") === "terms" && (
            <div>
              <h1 className="text-xl font-semibold">Умови використання</h1>
              <div className="my-4 flex items-center gap-x-4">
                <img width={100} src={monopay} alt="monopay" />
                <img width={40} src={mastercard} alt="mastercard" />
                <img width={50} src={visa} alt="visa" />
                <img width={55} src={applepay} alt="applepay" />
                <img width={55} src={googlepay} alt="googlepay" />
              </div>
              <p>
                ФОП Ліштван Сергій Олександрович (код ЄДРПОУ 3719907573), (далі
                &mdash; Виконавець),&nbsp;який діє на підставі свідоцтва про
                реєстрацію у відповідності до&nbsp;ст.641 Цивільного Кодексу
                України&nbsp;є офіційною пропозицією (публічною офертою)
                адміністратора сайту DIFFERENT-MARKETPLACE.COM, що є фізичною
                особою, надалі за текстом &ndash;&nbsp;&bdquo;
                <strong>Виконавець</strong>&rdquo;, укласти Договір з фізичною
                особою про надання рекламно-інформаційних послуг, надалі за
                текстом &ndash;&nbsp;&bdquo;<strong>Оферта</strong>&rdquo;, і
                містить істотні умови, необхідні для надання
                рекламно-інформаційних послуг, надалі за текстом
                &ndash;&nbsp;&bdquo;<strong>Послуги</strong>&rdquo;.
              </p>
              <p>
                1.2. Згідно з&nbsp;ч.2 ст.642 Цивільного Кодексу України&nbsp;у
                випадку прийняття нижче вказаних умов і сплати коштів за
                майбутні Послуги, фізичні особи цим самим засвідчують своє
                бажання укласти Оферту, ця дія і є прийняттям пропозиції
                (аксепт), і з цього моменту вони визначаються
                як&nbsp;&bdquo;Користувачі&rdquo;.
              </p>
              <p>
                1.3. У звязку з вищевикладеним, уважно прочитайте текст цієї
                Оферти і якщо Ви не згодні з яким-небудь пунктом оферти,
                Виконавець пропонує Вам відмовитися від використання Послуг.
              </p>
              <p>
                <br />
              </p>
              <p>
                <strong>1. Визначення понять</strong>
                <br />
                1.1. Сайт &mdash; інтернет-сайт DIFFERENT-MARKETPLACE.COM який
                представляє собою комунікаційну платформу для розміщення
                тимчасових оголошень.
              </p>
              <p>
                1.2. Користувач &mdash; будь-яка фізична, юридична особа та
                фізична особа-підприємець, яка акцептувала цю публічну оферту.
              </p>
              <p>
                <strong>2. Предмет договору</strong>
              </p>
              <p>
                2.1. Користувач отримує право розміщувати оголошення на Сайті
                після заповнення спеціальної форми із зазначенням параметрів
                запропонованих товарів або послуг.
              </p>
              <p>
                2.2 Використання можливостей і сервісів Сайта Користувачами
                означає прийняття зобов&apos;язань дотримуватися правил та
                інструкцій щодо користування послугами Виконавця, в тому числі
                цієї Угоди.
              </p>
              <p>
                2.3 З інформацією про вартість послуг, рекламні позиції, які на
                виконання цієї Оферти надає Виконавець, умови використання
                сайту, а також технічні вимоги, які ставляться до розміщення
                відповідних рекламно-інформаційних матеріалів, Замовник може
                ознайомитись на сайті DIFFERENT-MARKETPLACE.COM При укладенні
                Оферти Сторони керуються цією інформацією, яка являється
                невід&lsquo;ємною частиною, доповнюючи собою істотні умови
                Оферти і безпосередньо відноситься до цієї Оферти.
              </p>
              <p>
                2.4. Оферта, Прейскурант цін (вартість послуг) та Умови
                використання сайту є офіційними документами і публікуються на
                сайті DIFFERENT-MARKETPLACE.COM
              </p>
              <p>
                <strong>3. Приймання-передача наданих послуг</strong>
                <br />
                {/* TODO: update email */}
                3.1. У разі наявності зауважень по наданих послуг, Користувач
                надсилає зауваження на адресу електронної пошти
                hello.different.marketplace@gmail.com протягом одного місяця з
                моменту виявлення надання послуг неналежної якості. У разі
                відсутності зауважень, послуги вважаються прийнятими Клієнтом
                належним чином.
              </p>
              <p>
                <strong>4. Відповідальність сторін</strong>
                <br />
                4.1 Скориставшись сервісами Сайтів, Користувач підтверджує свою
                згоду з тим, що він використовує Сайти і його сервіси на свій
                страх і ризик &laquo;як є&raquo;, оцінює і несе всі ризики,
                пов&apos;язані з використанням розміщених на Сайтах оголошень, а
                Виконавець, в тому числі її керівництво , співробітники і
                агенти, не несуть ніякої відповідальності за зміст розміщених на
                Сайті оголошень, за будь-які збитки і втрати, які стали
                результатом використання розміщених на Сайтах оголошень
              </p>
              <p>
                4.2. Сторони звільняються від відповідальності за порушення
                зобов&rsquo;язань за Договором, якщо таке порушення є наслідком
                дії обставин непереборної сили і якщо Сторона доведе існування
                таких обставин.
              </p>
              <p>
                4.3. Під непереборною силою у Договорі розуміються будь-які
                надзвичайні події, які виникають без вини Сторін, поза їх волею
                або всупереч волі чи бажанню Сторін і які не можна за умови
                вжиття звичайних для цього заходів передбачити та не можна при
                всій обачності відвернути (уникнути), включаючи (але не
                обмежуючись) стихійні явища природного характеру (землетруси,
                пожежі, бурі, нагромадження снігу або ожеледь, повені, урагани,
                руйнування в результаті блискавки тощо), лиха біологічного,
                техногенного та антропогенного походження (вибухи, пожежі, вихід
                з ладу машин й обладнання, масові епідемії, епізоотії,
                епіфітотії тощо), обставини суспільного життя (війна, загроза
                війни, революції, заколоти, повстання, воєнні дії, блокади,
                громадські хвилювання, прояви тероризму, вибухи, масові страйки
                та локаути, бойкоти тощо), а також видання заборонних або
                обмежуючих актів органів державної влади чи місцевого
                самоврядування, інші законні або незаконні заборонні чи
                обмежуючі заходи названих органів, які унеможливлюють виконання
                Сторонами Договору або тимчасово перешкоджають такому виконанню.
              </p>
              <p>
                4.4. Сторона, для якої є неможливим виконання зобов&rsquo;язань
                за цим Договором внаслідок дії непереборної сили, повинна при
                першій можливості повідомити іншу Сторону про настання, ймовірну
                тривалість та закінчення строку таких дій.
              </p>
              <p>
                4.5. Доказом існування обставин непереборної сили та строку їх
                дії є належним чином оформлені довідки відповідних державних
                органів та/або Торговельної промислової палати за місцем
                виникнення такої події. Підтвердженням обставин непереборної
                сили, що відбулись у хостинг-провайдера Сайта (пожежа, повінь
                тощо) є повідомлення хостинг-провайдера.
              </p>
              <p>
                <strong>5.&nbsp;Порядок розрахунків</strong>
              </p>
              <p>
                5.1. Продавець сплачує комісію після продажу товару у розмірі 5%
                від вартості проданого товару.
              </p>
              <p>
                <strong>6. Строк дії договору</strong>
                <br />
                6.1. Цей Договор набуває чинності з моменту початку використання
                Користувачем будь-якого сервісу Сайту, або з моменту реєстрації
                Користувача на Сайті, і діє безстроково.
              </p>
              <p>
                <strong>7. Вирішення спорів</strong>
              </p>
              <p>
                7.1 Спори, що виникають між Сторонами вирішуються шляхом
                переговорів.
              </p>
              <p>
                7.2 Неврегульовані шляхом переговорів спори вирішуються шляхом
                передачі відповідного спору на розгляд до господарського суду
                згідно з встановленою підвідомчістю господарських справ
                відповідно до чинного законодавства України.
              </p>
              <p>
                <br />
              </p>
            </div>
          )}
        </div>
      </div>
    </div>
  );
};

export default InfoRoute;
